export default function Result(){
    return (
        <section>
            <div>
                <p>В результате - вы годами ходите по кругу, БЕЗ каких либо изменений:</p>
            </div>
            <div>
                <ul>
                    <li>Тихий, зажатый голос</li>
                    <li>Неприятный тембр</li>
                    <li>Пение «мимо нот»</li>
                    <li>Напряжение в горле</li>
                    <li>Насмешки и критика</li>
                    <li>Страшно выступать</li>
                </ul>
            </div>
        </section>
    )
}