export default function Reason(){
    return (
        <section>
            <div>
                <h3>
                    Дело в том, что 
                    <span>красивый голос - </span>
                    это автоматический навык
                </h3>
            </div>
            <div>
                <div>
                    <p>И да, петь и правда становится ЛЕГКО, если уметь:</p>
                </div>
                <div>
                    <ul>
                        <li>отслеживать свои ощущения</li>
                        <li>вдыхать в нужном месте и сколько нужно</li>
                        <li>повторять вокальные приемы звезд</li>
                        <li>разогревать свой голос перед выступлением</li>
                        <li>знать как добавить объема и убрать гнусавость</li>
                        <li>применять приемы на всем диапазоне</li>
                    </ul>
                </div>
                <div>
                    <ul>
                        <li>контролировать работу мышц пресса и голосового аппарата</li>
                        <li>формировать яркий звук и менять тембр</li>
                        <li>легко менять регистры - без срывов и петухов)</li>
                        <li>попадать в ноты на 100%</li>
                        <li>управлять расходом воздуха - для длинных нот</li>
                        <li>подсознательно применять всю технику - чтобы свободно творить на сцене!</li>
                    </ul>
                </div>
                <div>
                    <p>Много всего, правда? </p>
                </div>
            </div>
        </section>
    )
}