export default function Mistakes(){
    return (
        <section>
            {/* bg right center */}
            <div>
                <h4>И здесь не поможет подход «просто много петь»...</h4>
                <p>Просто менять репетиторов… Просто ходить в караоке…</p>
                <p>Нужна система, по которой вы двигаетесь - и получаете корректировки на каждом уроке</p>
                <p>Закрепляете правильные навыки, убираете ошибки, повторяете…</p>
                <p>И начинаете красиво звучать - уже на автомате!</p>
            </div>
        </section>
    )
}