export default function Formula(){
    return (
        <section>
            <div>
                <h3>
                    На самом деле есть простая
                    <span>Формула Красивого Голоса</span>
                </h3>
                <p>Только это не «дыхание в живот». И не «купол во рту».</p>
                <p>Ее не узнаешь и за 10 лет изучения теории музыки. Не поймешь через медитации и шаманские практики. Не выяснишь при хаотичном просмотре Ютюб уроков.</p>
                <p>
                    <img/>
                    Но этой универсальной формулой (осознанно или нет) пользуются почти
                    <img/>
                </p>
                <p>ВСЕ популярные исполнители, которых вы слышите на радио, ТВ и в соцсетях. </p>
                <p>Которые просто не смогли бы пробиться, если бы их голос не трогал людей до глубины души!</p>
                <p>Ладно, чего тянуть…</p>
            </div>
            <div>
                <h4>Формула красивого голоса - это:</h4>
                <div>
                    <span>1</span>
                    <span>2</span>
                    <span>3</span>
                    <span>4</span>
                    <span>5</span>
                    <span>6</span>
                </div>
                <button>Прокачать голос по формуле</button>
            </div>
        </section>
    )
}