export default function Because(){
    return (
        <section>
            <h3>Потому что на самом деле:</h3>
            <div>
                <div>
                    <p>ВАЖНО:</p>
                    <ul>
                        <li>Звучать на опоре и без зажимов</li>
                        <li>Попадать в ноты и слышать себя со стороны </li>
                        <li>Четко артикулировать</li>
                        <li>Раскрыть природный тембр</li>
                        <li>Соединить резонаторы</li>
                        <li>Использовать Микст</li>
                        <li>Применять вибрато и вокальные приемы</li>
                    </ul>
                    <p>Когда умеешь это <img /></p>
                </div>
                <div>
                    <p>Вообще НЕ ВАЖНО:</p>
                    <ul>
                        <li>Сотни распевок для разогрева</li>
                        <li>«100 грамм» чтобы запеть </li>
                        <li>Музыкальное образование</li>
                        <li>Пробуждение «горловой чакры» и «энергетическое» дыхание </li>
                        <li>Годы занятий с репетитором</li>
                        <li>Особое вдохновение, настроение, просветление</li>
                        <li>Вокальный талант от Бога)</li>
                    </ul>
                    <p>Это уже не нужно <img /></p>
                </div>
            </div>
        </section>
    )
}