export default function Variants(){
    return (
        <section>
            <h3>Варианты участия</h3>
            <div>
                {/* Первый вариант */}
                <div>
                    <div>
                        <h5>СТАРТОВЫЙ</h5>
                        <ul>
                            <li><b>1 ступень</b> - Постановка опоры и формирование звука.</li>
                            <li><b>2 ступень</b> - Четкость произношения (артикуляция).</li>
                            <li><b>3 ступень</b> - Звуковедение, акценты и динамика в пении.</li>
                            <li><b>4 ступень</b> - Резонаторы и тембр. Микс. Бэлтинг. Твэнг.</li>
                            <li><b>60</b> пошаговых видеоуроков, доступных с любого устройства.</li>
                            <li>Обратная связь по ДЗ в личном кабинете - на 6 месяцев.</li>
                        </ul>
                        <div>
                            <p>БОНУС:</p>
                            <p>Мини-курс «Идеальный Слух и Ритм»</p>
                        </div>
                    </div>
                    <div>
                        <p><s>30 000 руб</s></p>
                        <p>24 900 руб</p>
                        <p>(скидка 10% при оплате сразу)</p>
                        <button>Пройти курс!</button>
                        <p>от 1 990 руб/мес</p>
                        <button>Пройти  в рассрочку</button>
                    </div>
                </div>

                {/* Второй вариант */}
                <div>
                    <div>
                        <h5>ОСНОВНОЙ</h5>
                        <ul>
                            <li><b>1 ступень</b> - Постановка опоры и формирование звука.</li>
                            <li><b>2 ступень</b> - Четкость произношения (артикуляция).</li>
                            <li><b>3 ступень</b> - Звуковедение, акценты и динамика в пении.</li>
                            <li><b>4 ступень</b> - Резонаторы и тембр. Микс. Бэлтинг. Твэнг.</li>
                            <li><b>5 ступень</b> - Вокальные приемы и украшения.</li>
                            <li><b>87</b> пошаговых видеоуроков, доступных с любого устройства.</li>
                            <li>Обратная связь по ДЗ в личном кабинете - 1год.</li>
                            <li><b>12 индивидуальных уроков</b> с педагогом.</li>
                        </ul>
                        <div>
                            <p>БОНУС:</p>
                            <p>Мини-курс «Идеальный Слух и Ритм»</p>
                        </div>
                        <div>
                            <p>БОНУС:</p>
                            <p>Мини-курс «Вокальная Йога»</p>
                        </div>
                    </div>
                    <div>
                        <p><s>50 000 руб</s></p>
                        <p>37 900 руб</p>
                        <p>(скидка 10% при оплате сразу)</p>
                        <button>Пройти курс!</button>
                        <p>от 3 575 руб/мес</p>
                        <button>Пройти  в рассрочку</button>
                    </div>
                </div>

                {/* Третий вариант */}
                <div>
                    <div>
                        <h5>МАКСИМАЛЬНЫЙ</h5>
                        <ul>
                            <li>1 ступень - Постановка опоры и формирование звука.</li>
                            <li>2 ступень - Четкость произношения (артикуляция).</li>
                            <li>3 ступень - Звуковедение, акценты и динамика в пении.</li>
                            <li>4 ступень - Резонаторы и тембр. Микс. Бэлтинг. Твэнг.</li>
                            <li>5 ступень - Вокальные приемы и украшения.</li>
                            <li>6 ступень - Зарабатывай на выступлениях.</li>
                            <li>7 ступень - Зарабатывай на обучении вокалу.</li>
                            <li>109 пошаговых видеоуроков, доступных с любого устройства.</li>
                            <li>Обратная связь по ДЗ в личном кабинете - 1год.</li>
                            <li>30 индивидуальных уроков с педагогом.</li>
                        </ul>
                        <div>
                            <p>БОНУС:</p>
                            <p>Мини-курс «Идеальный Слух и Ритм»</p>
                        </div>
                        <div>
                            <p>БОНУС:</p>
                            <p>Мини-курс «Вокальная Йога»</p>
                        </div>
                        <div>
                            <p>БОНУС:</p>
                            <p>Работа с микрофоном и настройка аппаратуры для вокалиста»</p>
                        </div>
                    </div>
                    <div>
                        <p><s>90 000 руб</s></p>
                        <p>68 900 руб</p>
                        <p>(скидка 10% при оплате сразу)</p>
                        <button>Пройти курс!</button>
                        <p>от 6 240 руб/мес</p>
                        <button>Пройти  в рассрочку</button>
                    </div>
                </div>

            </div>
        </section>
    )
}